posts/2018-year-in-review/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2018 year in review | Rebeja</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://rebeja.eu/posts/2018-year-in-review/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Petru Rebeja">
<link rel="prev" href="../english-romanian-dictionary-for-machine-learning/" title="English Romanian dictionary for Machine Learning" type="text/html">
<meta property="og:site_name" content="Rebeja">
<meta property="og:title" content="2018 year in review">
<meta property="og:url" content="https://rebeja.eu/posts/2018-year-in-review/">
<meta property="og:description" content="Looking back at 2018 I can say for sure that it has been a busy and thankfully fruitfull year for me; I have managed to juggle work and community tasks while also spending time with my family.



So, ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2019-01-01T15:06:26+02:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="https://rebeja.eu/">

            <span id="blog-title">Rebeja</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">2018 year in review</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Petru Rebeja
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2019-01-01T15:06:26+02:00" itemprop="datePublished" title="2019-01-01 15:06">2019-01-01 15:06</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
Looking back at 2018 I can say for sure that it has been a busy and thankfully fruitfull year for me; I have managed to juggle work and community tasks while also spending time with my family.
</p>

<p>
So, without further ado here are my biggest accomplishments in 2018:
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Presentation on Big Data Analytics</h2>
<div class="outline-text-2" id="text-1">
<p>
Being known as a <i>Big Data enthusiast</i> at my job, I was asked if I could give a presentation on <i>Big Data</i>. I was more than happy to do so and this way I got a glimpse at how it feels when giving a lecture - <a href="https://www.facebook.com/CentricITSolutionsRomania/posts/2868690433237180">the presentation was scheduled</a> in one of the big lecture rooms at the <a href="http://www.feaa.uaic.ro">Faculty Of Economics and Business Administration</a>; can't say I didn't liked the feeling. The <a href="https://1drv.ms/p/s!AhX9uvfmpbmJnd4LKQn-eGppDHGdeg">slides</a> are available from my OneDrive account.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Artificial Neural Networks tutorial</h2>
<div class="outline-text-2" id="text-2">
<p>
A few weeks later I was <a href="https://www.facebook.com/infobalti/photos/a.1888888887828977/1888889244495608/">hosting a tutorial on Artificial Neural Networks</a> at <a href="http://usarb.md">Alecu Russo State University</a> from Bălți, Moldova. The tutorial was the first event at the <a href="http://www.miti2018.usarb.md/">International Conference on Mathematics, Informatics and Information Technologies</a> and also <b>my first academic talk</b>.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">PIN Magazine article about Artificial Intelligence</h2>
<div class="outline-text-2" id="text-3">
<p>
In june we celebrated one year since the <a href="https://iasi.ai/">Iași AI</a> community was created with a cover story in <a href="https://www.pinmagazine.ro/">PIN Magazine</a> about Artificial Intelligence. I authored one of the cover story articles in which I expressed my opinion about how Artificial Intelligence, although it had tremendous success lately, it's still at the beginning of its evolution and we, humans, must set our expectations accordingly but still expect that AI will change our lives. You can read the whole article <a href="https://issuu.com/danzaharia/docs/pinmagazine_9_cu_coperti/25">here</a>.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Iași AI TensorFlow workshops</h2>
<div class="outline-text-2" id="text-4">
<p>
At the end of August and in the beginning of October I co-hosted two <a href="https://iasi.ai/workshops/tensorflow-workshop-iasi-ai/">TensorFlow worksops</a> together with <a href="https://www.linkedin.com/in/ciprian-talmacel-6b08ba4a/">Ciprian Tălmăcel</a> organized by the <a href="https://iasi.ai/">Iași AI</a> community. This was my debut as a presenter within the community and proved to be a great experience and success. I had the opportunity to learn a lot from Ciprian and also to improve my skills through the feedback given by attendees. You can find the Jupyter Notebooks for the workshop in the <a href="https://github.com/IASIAI/tensorflow-workshop">dedicated Github repository</a>.
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">RNN presentation @ Iași AI</h2>
<div class="outline-text-2" id="text-5">
<p>
A month later, in November, was my second appearance within the Iași AI community, this time with a presentation about <a href="https://iasi.ai/meetups/unrolling-recurrent-neural-networks/">Recurrent Neural Networks</a>. The main focus of a presentation was how simple the code can be if you possess the theoretical background and how you can actually learn (to some extent) the theory behind just looking at the implementation. I have published the slides, the code and the LaTeX code for the presentation in a <a href="https://github.com/RePierre/manelator">dedicated Github repository</a>.
</p>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Other activity @ Iași AI</h2>
<div class="outline-text-2" id="text-6">
<p>
Gladly, my activity within Iași AI community did not end with the RNN presentation; later on, I helped organize the <a href="https://iasi.ai/meetups/panel-ai-opportunities/">AI opportunities panel</a> which was the last official event of the community for 2018. In parallel we started puring more effort into implementing an Open Data Hub initiative for Iași; this however is a project for the upcomming year(s).
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Promoted to Technical Lead</h2>
<div class="outline-text-2" id="text-7">
<p>
Last but not least, I got promoted at work. In April I switched projects at work and took the switch as an opportunity to affirm myself. The efforts I've put into building solid and scalable products and also improving the existing ones have been observed by the management team and at the end of the year I got promoted to the role of Technical Lead.
</p>

<p>
It's already the start of 2019 and I'm excited to what's comming ahead - the Open Data Hub, the newly opened opportunities at work, the upcomming projects in academia and many more I don't know of. What I do know is that <b>I will do my best to do even better in 2019</b>.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../english-romanian-dictionary-for-machine-learning/" rel="prev" title="English Romanian dictionary for Machine Learning">Previous post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2019         <a href="mailto:petru.rebeja@gmail.com">Petru Rebeja</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
